// గోడ घड्याळ

_सगळी_कडे_   కొలత;

// घड्याळ చుట్టూ క్షణముల గీతలు గీయుటకు
_कृती_     క్షణముల_గీతలు(x, y, వ్యాసార్థము) {
   _इथे_   గీత_लांबी = 7;
   _इथे_   ఖాళీ = వ్యాసార్థము - గీత_लांबी;
   रंग_बदला( 1 );
   रुंदी(1);
   मोजणे_करत_रहा( 60, ( కో ) => {
      _इथे_ థీటా = కో * 6;
      // ప్రతి  ఐదవది దళసరి గా వేయవలెను
      रुंदी( ( ( కో % 5 ) ? 1 : 3)/130* కొలత)
      कुंचला_उचला();
      स्थान_बदला(0,0);
      कोन_निश्चित_करा(థీటా);
      पुढे_जा(ఖాళీ);
      कुंचला_ठेवा();
      पुढे_जा(గీత_लांबी);
   });
   
}


// గంటలు, నిమిషాలూ సూచించే అంకెలు
_कृती_     అంకెలు(x, y, వ్యాసార్థము) {
   कुंचला_उचला();
   _इथे_  అక్షర_माप = 20/130 * కొలత
   आक्षर_रूप_बदला(అక్షర_माप+"px sans-serif");
   रंग_बदला("నలుపు");
   मोजणे_करत_रहा( 12, ( గంట ) =>{
      स्थान_बदला(x,y);
      कोन_निश्चित_करा(గంట * 30);
      पुढे_जा(వ్యాసార్థము); // to center of digit
      कोन_निश्चित_करा(180);
      पुढे_जा(10/130 * కొలత); // vertical correction to baseline
      उज्वी_कडे_वळा(90);
      // క్రింది, ఎడమ భాగమునకు అనుప్రస్థ సరదుబాటు
      पुढे_जा( ( (గంట < 10 ) ? 6 : 10 )/130 * కొలత)
      // if (గంట < 10) {
      //   पुढे_जा(6/130 * కొలత); // horizontal correction to lower left corner
      // } else {
      //   पुढे_जा(10/130 * కొలత)
      // }
      उज्वी_कडे_वळा(180);
      लिहा(గంట);
   })
   कुंचला_ठेवा();
}

// చేతులు గీయుటకు  
_कृती_     చెయ్యి (థీటా, చెయ్యి_रुंदी, लांबी, रंग) {
   _इथे_   కూచి_తగ్గింపు = 5;
   _इथे_   కూచి_తగ్గింపులు = (लांबी / కూచి_తగ్గింపు);
   _इथे_   रुंदी_సర్దుబాటు =  చెయ్యి_रुंदी / కూచి_తగ్గింపులు;
   स्थान_बदला(0, 0);
   कोन_निश्चित_करा(థీటా);
   रंग_बदला(रंग);
   // for (_सगळी_कडे_   step = 0; step < लांबी; step = step + కూచి_తగ్గింపు) 
   मोजणे_करत_रहा( కూచి_తగ్గింపులు, ( అడుగు) => 
   {
      रुंदी( చెయ్యి_रुंदी ); // కుంచిక रुंदी
      पुढे_जा(కూచి_తగ్గింపు);
      చెయ్యి_रुंदी =  చెయ్యి_रुंदी  - रुंदी_సర్దుబాటు;
   }
   );
}

_कृती_     చేతులు(గంటలు, నిమిషములు, క్షణములు) {
    // క్షణముల చెయ్యి
    _इथे_   క్షణముకెన్ని_డిగ్రీలు = 6;	// = 360 degrees/60 క్షణములు
    చెయ్యి(క్షణములు * క్షణముకెన్ని_డిగ్రీలు, 4, 100/130 * కొలత, "red");
    // నిమిషముల చెయ్యి 
    _इथे_   నిమిషానికెన్ని_డిగ్రీలు = 0.1;	// = 360 degrees /3600 క్షణములు /గంట
    _इथे_   నిమిషములుInక్షణములు = నిమిషములు * 60 + క్షణములు;
    చెయ్యి(నిమిషములుInక్షణములు * నిమిషానికెన్ని_డిగ్రీలు, 10, 100/130 * కొలత, "blue");
    // గంటల చెయ్యి
    _इथे_   గంటకెన్ని_డిగ్రీలు = .1/12;	// = నిమిషానికెన్ని_డిగ్రీలు / 12 గంటలు 
    _इथे_   గంటలుInక్షణములు = ((గంటలు % 12) * 3600) + నిమిషములుInక్షణములు;
    చెయ్యి(గంటలుInక్షణములు * గంటకెన్ని_డిగ్రీలు, 10, 60/130 * కొలత, "green");
}

// घड्याळను పునరావృతము చేయుటకు
_कृती_     घड्याळ() {
   चित्र_पूसा();
   కొలత = .9 *  Math.min( जास्तीत_जास्त_X(), जास्तीत_जास्त_Y())
   అంకెలు(0, 0, 110/130 * కొలత);
   रंग_बदला("lightgreen");
   स्थान_बदला(0,0);
   रुंदी(1/130* కొలత)
   वर्तुळ(130/130 * కొలత );
   క్షణముల_గీతలు(0, 0, 130/130 * కొలత );
   _इथे_  సమయము = new Date();
   చేతులు(సమయము.getHours(), సమయము.getMinutes(), సమయము.getSeconds());
}

_कृती_     प्रदर्शन() {
   प्रथम_स्थिति();
   कुंचला_लपवा();
   चालू_करा(घड्याळ,1000); // घड्याळను ప్రతి క్షణము పునరావృతము చేయ వలెను.
}
