
वर्गमुळ = Math.sqrt

प्रदर्शन = () => {

  _कायम_ సవ్య = हो;
  _कायम_ అపసవ్య = !సవ్య;

  प्रथम_स्थिति();
  कुंचला_लपवा();

मासा = ( వ ) => {
  वर्तुळ( వ )
  उज्वी_कडे_वळा( 90 );

  कुंचला_उचला()
  पुढे_जा( వ );
  कुंचला_ठेवा()

  कुंचला_दाखवा();


  दावी_कडे_वळा( 45 );
  पुढे_जा( 2 * వ );
  उज्वी_कडे_वळा(90+45)

  पुढे_जा( वर्गमुळ( 2 * వ * 2 * వ * 2 ) );

  उज्वी_कडे_वळा(90+45)
  पुढे_जा( 2 * వ );
  दावी_कडे_वळा( 45 );

  // कुंचला_लपवा();

  कुंचला_उचला()
  पुढे_जा( వ );
  कुंचला_ठेवा()

  उज्वी_कडे_वळा( 90 );
}

रंग_मासा = (रंग_आकडा) =>  {
  रंग_बदला(रंग_आकडा)
 मासा( 40 + ( रंग_आकडा * 1 ) )
} 
मोजणे_करत_रहा( 16 , (క) => रंग_मासा( క ) )

}
