// वीट ప్రస్తారము 

_कायम_    ऊंची = 15
_कायम_    रुंदी = 2* ऊंची 

// वीट == ఇటుక 

वीट = ( ऊंची, रुंदी, वीटेचा_रंग) => {
  आकार_काढा()
  करत_रहा (2, () => {
    पुढे_जा( रुंदी)
    उज्वी_कडे_वळा(90)
    पुढे_जा( ऊंची)
    उज्वी_कडे_वळा(90)
  })
  आकार_काढणे_थांबवा( वीटेचा_रंग)
  पुढे_जा( रुंदी)
}

प्रदर्शन = () => {
  प्रथम_स्थिति()
 
  yB = जास्तीत_जास्त_Y()
  xB = कमीत_कमी_X()
   गुंडााळु_नका()
  उज्वी_कडे_वळा( 90)
  रंग_बदला( 7 )

  असे_पर्यन्त_करत_रहा( () => కుంచిక.స్థానము.y > कमीत_कमी_Y(), () => {
    स्थान_बदला(xB, yB)
    असे_पर्यन्त_करत_रहा( () => కుంచిక.స్థానము.x < जास्तीत_जास्त_X(), () => {
      कुंचला_ठेवा()
      वीट(ऊंची, रुंदी, "darkred")
      कुंचला_उचला()
    } )
    yB = yB - ऊंची

    स्थान_बदला(xB - रुंदी/2, yB)
    असे_पर्यन्त_करत_रहा( () => కుంచిక.స్థానము.x < जास्तीत_जास्त_X(), () => {
      कुंचला_ठेवा()
      वीट(ऊंची, रुंदी, "darkred")
      कुंचला_उचला()
    } )
    yB = yB - ऊंची
  } )
}
