

ವರ್ಗಮೂಲ = Math.sqrt

ಪ್ರದರ್ಶನೆ = () => {
  ಆದಿ_ಸ್ಥಿತಿ();
  కుంచికను_దాచు();

ಮತ್ಸ್ಯ = ( ವ ) => {
  వృత్తము( ವ )
  కుడి_వైపు_తిరుగు( 90 );

  కుంచికను_పైకి_ఎత్తు()
  ముందుకు_జరుగు( ವ );
  కుంచికను_కింద_పెట్టు()

  కుంచికను_చూపు();


  ఎడమ_వైపు_తిరుగు( 45 );
  ముందుకు_జరుగు( 2 * ವ );
  కుడి_వైపు_తిరుగు(90+45)

  ముందుకు_జరుగు( ವರ್ಗಮೂಲ( 2 * ವ * 2 * ವ * 2 ) );

  కుడి_వైపు_తిరుగు(90+45)
  ముందుకు_జరుగు( 2 * ವ );
  ఎడమ_వైపు_తిరుగు( 45 );

  // కుంచికను_దాచు();

  కుంచికను_పైకి_ఎత్తు()
  ముందుకు_జరుగు( ವ );
  కుంచికను_కింద_పెట్టు()

  కుడి_వైపు_తిరుగు( 90 );
}

రంగు_చేప = (రంగు_సంఖ్య) =>  {
  రంగు_మార్చు(రంగు_సంఖ్య)
 చేప( 40 + ( రంగు_సంఖ్య * 1 ) )
} 
లెక్క_పెడుతూ_ఆవర్తించు( 16 , (క) => రంగు_చేప( క ) )

}
