// గోడ гадзіннік

_усюды_   కొలత;

// గడియారము చుట్టూ క్షణముల గీతలు గీయుటకు
_працэдура_     క్షణముల_గీతలు(x, y, వ్యాసార్థము) {
   _тут_   గీత_даўжыня = 7;
   _тут_   ఖాళీ = వ్యాసార్థము - గీత_даўжыня;
   змяніць_колер_на( 1 );
   усталяваць_шырыню(1);
   паўтарыць_лічачы( 60, ( కో ) => {
      _тут_ థీటా = కో * 6;
      // ప్రతి  ఐదవది దళసరి గా వేయవలెను
      усталяваць_шырыню( ( ( కో % 5 ) ? 1 : 3)/130* కొలత)
      падніміце_пэндзаль();
      змяніць_становішча(0,0);
      вугал(థీటా);
      ісці_наперад(ఖాళీ);
      пакладзеце_пэндзаль();
      ісці_наперад(గీత_даўжыня);
   });
   
}


// గంటలు, నిమిషాలూ సూచించే అంకెలు
_працэдура_     అంకెలు(x, y, వ్యాసార్థము) {
   падніміце_пэндзаль();
   _тут_  అక్షర_памер = 20/130 * కొలత
   ўсталяваць_шрыфт(అక్షర_памер+"px sans-serif");
   змяніць_колер_на("నలుపు");
   паўтарыць_лічачы( 12, ( గంట ) =>{
      змяніць_становішча(x,y);
      вугал(గంట * 30);
      ісці_наперад(వ్యాసార్థము); // to center of digit
      вугал(180);
      ісці_наперад(10/130 * కొలత); // vertical correction to baseline
      павярнуць_направа(90);
      // క్రింది, ఎడమ భాగమునకు అనుప్రస్థ సరదుబాటు
      ісці_наперад( ( (గంట < 10 ) ? 6 : 10 )/130 * కొలత)
      // if (గంట < 10) {
      //   ісці_наперад(6/130 * కొలత); // horizontal correction to lower left corner
      // } else {
      //   ісці_наперад(10/130 * కొలత)
      // }
      павярнуць_направа(180);
      запісаць(గంట);
   })
   пакладзеце_пэндзаль();
}

// చేతులు గీయుటకు  
_працэдура_     చెయ్యి (థీటా, చెయ్యి_усталяваць_шырыню, даўжыня, రంగు) {
   _тут_   కూచి_తగ్గింపు = 5;
   _тут_   కూచి_తగ్గింపులు = (даўжыня / కూచి_తగ్గింపు);
   _тут_   усталяваць_шырыню_సర్దుబాటు =  చెయ్యి_усталяваць_шырыню / కూచి_తగ్గింపులు;
   змяніць_становішча(0, 0);
   вугал(థీటా);
   змяніць_колер_на(రంగు);
   // for (_усюды_   step = 0; step < даўжыня; step = step + కూచి_తగ్గింపు) 
   паўтарыць_лічачы( కూచి_తగ్గింపులు, ( అడుగు) => 
   {
      усталяваць_шырыню( చెయ్యి_усталяваць_шырыню ); // కుంచిక усталяваць_шырыню
      ісці_наперад(కూచి_తగ్గింపు);
      చెయ్యి_усталяваць_шырыню =  చెయ్యి_усталяваць_шырыню  - усталяваць_шырыню_సర్దుబాటు;
   }
   );
}

_працэдура_     చేతులు(గంటలు, నిమిషములు, క్షణములు) {
    // క్షణముల చెయ్యి
    _тут_   క్షణముకెన్ని_డిగ్రీలు = 6;	// = 360 degrees/60 క్షణములు
    చెయ్యి(క్షణములు * క్షణముకెన్ని_డిగ్రీలు, 4, 100/130 * కొలత, "red");
    // నిమిషముల చెయ్యి 
    _тут_   నిమిషానికెన్ని_డిగ్రీలు = 0.1;	// = 360 degrees /3600 క్షణములు /గంట
    _тут_   నిమిషములుInక్షణములు = నిమిషములు * 60 + క్షణములు;
    చెయ్యి(నిమిషములుInక్షణములు * నిమిషానికెన్ని_డిగ్రీలు, 10, 100/130 * కొలత, "blue");
    // గంటల చెయ్యి
    _тут_   గంటకెన్ని_డిగ్రీలు = .1/12;	// = నిమిషానికెన్ని_డిగ్రీలు / 12 గంటలు 
    _тут_   గంటలుInక్షణములు = ((గంటలు % 12) * 3600) + నిమిషములుInక్షణములు;
    చెయ్యి(గంటలుInక్షణములు * గంటకెన్ని_డిగ్రీలు, 10, 60/130 * కొలత, "green");
}

// గడియారమును పునరావృతము చేయుటకు
_працэдура_     గడియారము() {
   сціраць();
   కొలత = .9 *  Math.min( максімум_X(), максімум_Y())
   అంకెలు(0, 0, 110/130 * కొలత);
   змяніць_колер_на("lightgreen");
   змяніць_становішча(0,0);
   усталяваць_шырыню(1/130* కొలత)
   круг(130/130 * కొలత );
   క్షణముల_గీతలు(0, 0, 130/130 * కొలత );
   _тут_  సమయము = new Date();
   చేతులు(సమయము.getHours(), సమయము.getMinutes(), సమయము.getSeconds());
}

_працэдура_     паказаць() {
   пачатковы_стан();
   схавайце_пэндзаль();
   гуляць(గడియారము,1000); // గడియారమును ప్రతి క్షణము పునరావృతము చేయ వలెను.
}
