
వర్గమూలము = Math.sqrt

паказаць = () => {

  _назаўжды_ సవ్య = так;
  _назаўжды_ అపసవ్య = !సవ్య;

  пачатковы_стан();
  схавайце_пэндзаль();

చేప = ( వ ) => {
  круг( వ )
  павярнуць_направа( 90 );

  падніміце_пэндзаль()
  ісці_наперад( వ );
  пакладзеце_пэндзаль()

  выявіць_пэндзаль();


  павярнуць_налева( 45 );
  ісці_наперад( 2 * వ );
  павярнуць_направа(90+45)

  ісці_наперад( వర్గమూలము( 2 * వ * 2 * వ * 2 ) );

  павярнуць_направа(90+45)
  ісці_наперад( 2 * వ );
  павярнуць_налева( 45 );

  // схавайце_пэндзаль();

  падніміце_пэндзаль()
  ісці_наперад( వ );
  пакладзеце_пэндзаль()

  павярнуць_направа( 90 );
}

రంగు_చేప = (колер_нумар) =>  {
  змяніць_колер_на(колер_нумар)
 చేప( 40 + ( колер_нумар * 1 ) )
} 
паўтарыць_лічачы( 16 , (క) => రంగు_చేప( క ) )

}
