
// сняжынкі
Мінімальны_кошт = Math.min

_працэдура_     кох_лайн (даўжыня, колькасць_слаёў) {
  Калі_тады_інакш( () => (колькасць_слаёў == 0),
   () => {    ісці_наперад(даўжыня);  },
   () => {
    // левы бакавы пялёстак
    кох_лайн (даўжыня/3, колькасць_слаёў-1);
    павярнуць_налева(60); 
    кох_лайн (даўжыня/3, колькасць_слаёў-1);
    павярнуць_направа(120); 
    кох_лайн (даўжыня/3, колькасць_слаёў-1);
    павярнуць_налева(60); 
    кох_лайн (даўжыня/3, колькасць_слаёў-1);
  } )
}


_працэдура_     Кох_сняжынка (даўжыня, колькасць_слаёў) {
  вугал (30);
  змяніць_становішча(-даўжыня/2,-.3 * даўжыня);
  кох_лайн (даўжыня, колькасць_слаёў);
  павярнуць_направа(120);
  кох_лайн (даўжыня, колькасць_слаёў);
  павярнуць_направа(120);
  кох_лайн (даўжыня, колькасць_слаёў);
  павярнуць_направа(120);
}
  
сняжынкі = ()=> {
  колер_пялёсткаў.push(выпадковы_лік(15) );
  колер_пялёсткаў.shift();
  паўтарыць_лічачы (6, ( క ) => {
    змяніць_колер_на( колер_пялёсткаў [క] );
    Кох_сняжынка( даўжыня * (క+1) * (క+1), క)
  } );
}

_працэдура_     паказаць() {
  пачатковы_стан();
  даўжыня = .045* Мінімальны_кошт(максімум_X(), максімум_Y())
  колер_пялёсткаў = [];
  паўтарыць_лічачы (6, ( క ) => {
    колер_пялёсткаў[క] = выпадковы_лік(6);
  } );

  схавайце_пэндзаль();
  гуляць(сняжынкі,1)
}
