// మూలము: https://pythonturtle.academy/tutorial-drawing-egg-shape-with-python-turtle/

яйка = (x, y, памер, схіл) => {
  падніміце_пэндзаль()
  змяніць_становішча(x,y)
  пакладзеце_пэндзаль()
  змінниць_кіруна(270+схіл)
  змяніць_колер_на(ఎరుపు)
  дуга_направа(памер,180)
  змяніць_колер_на(1)
  дуга_направа(2*памер,45)
  змяніць_колер_на("ఆకుపచ్చ")
  дуга_направа(0.586*памер,90)
  змяніць_колер_на(1)
  дуга_направа(2*памер,45)
}

паказаць = () => {
  пачатковы_стан();
  схавайце_пэндзаль();
  яйка( 90, 90, 40, 0 )
  яйка( 0, 0, 90, 45 )
}
