квадратен_корен = Math.sqrt;

показване = () => {
  начално_състояние();
  четката_скрий();

  риба = (వ) => {
    кръг(వ);
    надясно(90);

    четката_нагоре();
    напред(వ);
    четката_надолу();

    четката_покажи();

    наляво(45);
    напред(2 * వ);
    надясно(90 + 45);

    напред(квадратен_корен(2 * వ * 2 * వ * 2));

    надясно(90 + 45);
    напред(2 * వ);
    наляво(45);

    // четката_скрий();

    четката_нагоре();
    напред(వ);
    четката_надолу();

    надясно(90);
  };

  цвят_риба = (номер_на_цвета) => {
    цвят_промени(номер_на_цвета);
    риба(40 + номер_на_цвета * 1);
  };
  броиш_и_повтаряш(16, (క) => цвят_риба(క));
};
