// Тухлена ప్రస్తారము 

_винаги_    височина = 15
_винаги_    ширина = 2* височина 

// Тухлена == ఇటుక 

Тухлена = ( височина, ширина, предпочитан_цвят) => {
  формата_започва()
  повтаряй (2, () => {
    напред( ширина)
    надясно(90)
    напред( височина)
    надясно(90)
  })
  формата_свършва( предпочитан_цвят)
  напред( ширина)
}

показване = () => {
  начално_състояние()
 
  yB = максимална_Y()
  xB = минимална_X()
   не_обикаляй()
  надясно( 90)
  цвят_промени( 7 ) // бяло

  целия_цикъл( () => కుంచిక.స్థానము.y > минимална_Y(), () => {
    позицията_промени(xB, yB)
    целия_цикъл( () => కుంచిక.స్థానము.x < максимална_X(), () => {
      четката_надолу()
      Тухлена(височина, ширина, "darkred")
      четката_нагоре()
    } )
    yB = yB - височина

    позицията_промени(xB - ширина/2, yB)
    целия_цикъл( () => కుంచిక.స్థానము.x < максимална_X(), () => {
      четката_надолу()
      Тухлена(височина, ширина, "darkred")
      четката_нагоре()
    } )
    yB = yB - височина
  } )
}
