// గోడ часовник

_навсякъде_   కొలత;

// часовник చుట్టూ క్షణముల గీతలు గీయుటకు
_метод_     క్షణముల_గీతలు(x, y, వ్యాసార్థము) {
   _тук_   గీత_дължина = 7;
   _тук_   ఖాళీ = వ్యాసార్థము - గీత_дължина;
   цвят_промени( 1 ) ; // синьо ;
   ширина(1);
   броиш_и_повтаряш( 60, ( కో ) => {
      _тук_ థీటా = కో * 6;
      // ప్రతి  ఐదవది దళసరి గా వేయవలెను
      ширина( ( ( కో % 5 ) ? 1 : 3)/130* కొలత)
      четката_нагоре();
      позицията_промени(0,0);
      ъгъл(థీటా);
      напред(ఖాళీ);
      четката_надолу();
      напред(గీత_дължина);
   });
   
}


// గంటలు, నిమిషాలూ సూచించే అంకెలు
_метод_     అంకెలు(x, y, వ్యాసార్థము) {
   четката_нагоре();
   _тук_  అక్షర_размер = 20/130 * కొలత
   шрифт_установи(అక్షర_размер+"px sans-serif");
   цвят_промени("నలుపు");
   броиш_и_повтаряш( 12, ( గంట ) =>{
      позицията_промени(x,y);
      ъгъл(గంట * 30);
      напред(వ్యాసార్థము); // to center of digit
      ъгъл(180);
      напред(10/130 * కొలత); // vertical correction to baseline
      надясно(90);
      // క్రింది, ఎడమ భాగమునకు అనుప్రస్థ సరదుబాటు
      напред( ( (గంట < 10 ) ? 6 : 10 )/130 * కొలత)
      // if (గంట < 10) {
      //   напред(6/130 * కొలత); // horizontal correction to lower left corner
      // } else {
      //   напред(10/130 * కొలత)
      // }
      надясно(180);
      пиши(గంట);
   })
   четката_надолу();
}

// చేతులు గీయుటకు  
_метод_     చెయ్యి (థీటా, చెయ్యి_ширина, дължина, цвят) {
   _тук_   కూచి_తగ్గింపు = 5;
   _тук_   కూచి_తగ్గింపులు = (дължина / కూచి_తగ్గింపు);
   _тук_   ширина_సర్దుబాటు =  చెయ్యి_ширина / కూచి_తగ్గింపులు;
   позицията_промени(0, 0);
   ъгъл(థీటా);
   цвят_промени(цвят);
   // for (_навсякъде_   step = 0; step < дължина; step = step + కూచి_తగ్గింపు) 
   броиш_и_повтаряш( కూచి_తగ్గింపులు, ( అడుగు) => 
   {
      ширина( చెయ్యి_ширина ); // కుంచిక ширина
      напред(కూచి_తగ్గింపు);
      చెయ్యి_ширина =  చెయ్యి_ширина  - ширина_సర్దుబాటు;
   }
   );
}

_метод_     చేతులు(గంటలు, నిమిషములు, క్షణములు) {
    // క్షణముల చెయ్యి
    _тук_   క్షణముకెన్ని_డిగ్రీలు = 6;	// = 360 degrees/60 క్షణములు
    చెయ్యి(క్షణములు * క్షణముకెన్ని_డిగ్రీలు, 4, 100/130 * కొలత, "red");
    // నిమిషముల చెయ్యి 
    _тук_   నిమిషానికెన్ని_డిగ్రీలు = 0.1;	// = 360 degrees /3600 క్షణములు /గంట
    _тук_   నిమిషములుInక్షణములు = నిమిషములు * 60 + క్షణములు;
    చెయ్యి(నిమిషములుInక్షణములు * నిమిషానికెన్ని_డిగ్రీలు, 10, 100/130 * కొలత, "blue");
    // గంటల చెయ్యి
    _тук_   గంటకెన్ని_డిగ్రీలు = .1/12;	// = నిమిషానికెన్ని_డిగ్రీలు / 12 గంటలు 
    _тук_   గంటలుInక్షణములు = ((గంటలు % 12) * 3600) + నిమిషములుInక్షణములు;
    చెయ్యి(గంటలుInక్షణములు * గంటకెన్ని_డిగ్రీలు, 10, 60/130 * కొలత, "green");
}

// часовникను పునరావృతము చేయుటకు
_метод_     часовник() {
   изтрий();
   కొలత = .9 *  Math.min( максимална_X(), максимална_Y())
   అంకెలు(0, 0, 110/130 * కొలత);
   цвят_промени("lightgreen");
   позицията_промени(0,0);
   ширина(1/130* కొలత)
   кръг(130/130 * కొలత );
   క్షణముల_గీతలు(0, 0, 130/130 * కొలత );
   _тук_  సమయము = new Date();
   చేతులు(సమయము.getHours(), సమయము.getMinutes(), సమయము.getSeconds());
}

_метод_     показване() {
   начално_състояние();
   четката_скрий();
   играй(часовник,1000); // часовникను ప్రతి క్షణము పునరావృతము చేయ వలెను.
}
