// れんが ప్రస్తారము 

_いつも_    たかさ = 15
_いつも_    はば = 2* たかさ 

// れんが == ఇటుక 

れんが = ( たかさ, はば, ఇష్టికいろ) => {
  かたちをはじめめる()
  くりかえす (2, () => {
    すすむ( はば)
    みぎにまがる(90)
    すすむ( たかさ)
    みぎにまがる(90)
  })
  かたちをおわる( ఇష్టికいろ)
  すすむ( はば)
}

ひょうじ = () => {
  しょいたい()
 
  yB = さいだいY()
  xB = さいしょうX()
   まわさないで()
  みぎにまがる( 90)
  いろをかえる( 7 )

  くりかえし( () => కుంచిక.స్థానము.y > さいしょうY(), () => {
    いちをうつる(xB, yB)
    くりかえし( () => కుంచిక.స్థానము.x < さいだいX(), () => {
      ふをおろす()
      れんが(たかさ, はば, "darkred")
      ふでをあげる()
    } )
    yB = yB - たかさ

    いちをうつる(xB - はば/2, yB)
    くりかえし( () => కుంచిక.స్థానము.x < さいだいX(), () => {
      ふをおろす()
      れんが(たかさ, はば, "darkred")
      ふでをあげる()
    } )
    yB = yB - たかさ
  } )
}
