// గోడ 时钟

_到处_   尺寸;

// 秒刻度
// 时钟 చుట్టూ క్షణముల గీతలు గీయుటకు
_步骤_     秒刻度(x, y, 半径) {
   _此处_   指针_长度 = 7;
   _此处_   差值 = 半径 - 指针_长度;
   改变颜色为( 1 );  // 蓝色 
   宽度(1);
   计数并重复( 60, ( 秒 ) => {
      _此处_ 夹角 = 秒 * 6;
      // ప్రతి  ఐదవది దళసరి గా వేయవలెను
      宽度( ( ( 秒 % 5 ) ? 1 : 3)/130* 尺寸)
      抬起笔刷();
      改变位置(0,0);
      角度(夹角);
      向前移动(差值);
      放下笔刷();
      向前移动(指针_长度);
   });

}

// 小时和分钟数字
// గంటలు, నిమిషాలూ సూచించే అంకెలు
_步骤_     అంకెలు(x, y, 半径) {
   抬起笔刷();
   _此处_  字体_尺寸 = 20/130 * 尺寸
   设置字体(字体_尺寸+"px sans-serif");
   改变颜色为(0);
   计数并重复( 12, ( 小时 ) =>{
      改变位置(x,y);
      角度(小时 * 30);
      向前移动(半径); // to center of digit
      角度(180);
      向前移动(10/130 * 尺寸); // vertical correction to baseline
      向右转(90);
      // క్రింది, ఎడమ భాగమునకు అనుప్రస్థ సరదుబాటు
      向前移动( ( (小时 < 10 ) ? 6 : 10 )/130 * 尺寸)
      // if (గంట < 10) {
      //   向前移动(6/130 * కొలత); // horizontal correction to lower left corner\n\
      // } else {
      //   向前移动(10/130 * కొలత)
      // }
      向右转(180);
      写(小时);
   })
   放下笔刷();
}

// చేతులు గీయుటకు  
_步骤_     指针 (角, 指针_宽度, 长度, 颜色) {
   _此处_   కూచి_తగ్గింపు = 5;
   _此处_   కూచి_తగ్గింపులు = (长度 / కూచి_తగ్గింపు);
   _此处_   宽度_调整 =  指针_宽度 / కూచి_తగ్గింపులు;
   改变位置(0, 0);
   角度(角);
   改变颜色为(颜色);
   // for (_到处_   步长 = 0; 步长 < 长度; 步长 = 步长 + కూచి_తగ్గింపు) 
   计数并重复( కూచి_తగ్గింపులు, () => 
   {
      宽度( 指针_宽度 ); // కుంచిక 宽度
      向前移动(కూచి_తగ్గింపు);
      指针_宽度 =  指针_宽度  - 宽度_调整;
   }
   );
}

_步骤_     时间(小时, 分钟, 秒) {
    // 时针
    _此处_   每秒度数 = 6;	// = 360 degrees/60 秒
    指针(秒 * 每秒度数, 4, 100/130 * 尺寸, "red");
    // 分针 
    _此处_   每分钟度数 = 0.1;	// = 360 degrees /3600 秒 /గంట
    _此处_   分钟换算为秒 = 分钟 * 60 + 秒;
    指针(分钟换算为秒 * 每分钟度数, 10, 100/130 * 尺寸, "blue");
    // 秒针
    _此处_   每小时度数 = .1/12;	// = 每分钟度数 / 12 小时 
    _此处_   小时换算为秒 = ((小时 % 12) * 3600) + 分钟换算为秒;
    指针(小时换算为秒 * 每小时度数, 10, 60/130 * 尺寸, "green");
}

// 刷新时钟
_步骤_     时钟() {
   擦除画布();
   尺寸 = .9 *  Math.min( 最大_X_值(), 最大_Y_值())
   అంకెలు(0, 0, 110/130 * 尺寸);
   改变颜色为("lightgreen");
   改变位置(0,0);
   宽度(1/130* 尺寸)
   圆形(130/130 * 尺寸 );
   秒刻度(0, 0, 130/130 * 尺寸 );
   _此处_  当前时间 = new Date();
   时间(当前时间.getHours(), 当前时间.getMinutes(), 当前时间.getSeconds());
}

_步骤_     演示() {
   初始状态();
   隐藏笔刷();
   播放(时钟,1000); // 时钟ను ప్రతి క్షణము పునరావృతము చేయ వలెను.
}\n\