// గోడ 时钟

_到处_   కొలత;

// 时钟 చుట్టూ క్షణముల గీతలు గీయుటకు
_步骤_     క్షణముల_గీతలు(x, y, వ్యాసార్థము) {
   _此处_   గీత_长度 = 7;
   _此处_   ఖాళీ = వ్యాసార్థము - గీత_长度;
   改变颜色为( 1 );  // 蓝色 
   宽度(1);
   计数并重复( 60, ( కో ) => {
      _此处_ థీటా = కో * 6;
      // ప్రతి  ఐదవది దళసరి గా వేయవలెను
      宽度( ( ( కో % 5 ) ? 1 : 3)/130* కొలత)
      抬起笔刷();
      改变位置(0,0);
      角度(థీటా);
      向前移动(ఖాళీ);
      放下笔刷();
      向前移动(గీత_长度);
   });
   
}


// గంటలు, నిమిషాలూ సూచించే అంకెలు
_步骤_     అంకెలు(x, y, వ్యాసార్థము) {
   抬起笔刷();
   _此处_  అక్షర_尺寸 = 20/130 * కొలత
   设置字体(అక్షర_尺寸+"px sans-serif");
   改变颜色为("నలుపు");
   计数并重复( 12, ( గంట ) =>{
      改变位置(x,y);
      角度(గంట * 30);
      向前移动(వ్యాసార్థము); // to center of digit
      角度(180);
      向前移动(10/130 * కొలత); // vertical correction to baseline
      向右转(90);
      // క్రింది, ఎడమ భాగమునకు అనుప్రస్థ సరదుబాటు
      向前移动( ( (గంట < 10 ) ? 6 : 10 )/130 * కొలత)
      // if (గంట < 10) {
      //   向前移动(6/130 * కొలత); // horizontal correction to lower left corner
      // } else {
      //   向前移动(10/130 * కొలత)
      // }
      向右转(180);
      写(గంట);
   })
   放下笔刷();
}

// చేతులు గీయుటకు  
_步骤_     చెయ్యి (థీటా, చెయ్యి_宽度, 长度, 颜色) {
   _此处_   కూచి_తగ్గింపు = 5;
   _此处_   కూచి_తగ్గింపులు = (长度 / కూచి_తగ్గింపు);
   _此处_   宽度_సర్దుబాటు =  చెయ్యి_宽度 / కూచి_తగ్గింపులు;
   改变位置(0, 0);
   角度(థీటా);
   改变颜色为(颜色);
   // for (_到处_   step = 0; step < 长度; step = step + కూచి_తగ్గింపు) 
   计数并重复( కూచి_తగ్గింపులు, ( అడుగు) => 
   {
      宽度( చెయ్యి_宽度 ); // కుంచిక 宽度
      向前移动(కూచి_తగ్గింపు);
      చెయ్యి_宽度 =  చెయ్యి_宽度  - 宽度_సర్దుబాటు;
   }
   );
}

_步骤_     చేతులు(గంటలు, నిమిషములు, క్షణములు) {
    // క్షణముల చెయ్యి
    _此处_   క్షణముకెన్ని_డిగ్రీలు = 6;	// = 360 degrees/60 క్షణములు
    చెయ్యి(క్షణములు * క్షణముకెన్ని_డిగ్రీలు, 4, 100/130 * కొలత, "red");
    // నిమిషముల చెయ్యి 
    _此处_   నిమిషానికెన్ని_డిగ్రీలు = 0.1;	// = 360 degrees /3600 క్షణములు /గంట
    _此处_   నిమిషములుInక్షణములు = నిమిషములు * 60 + క్షణములు;
    చెయ్యి(నిమిషములుInక్షణములు * నిమిషానికెన్ని_డిగ్రీలు, 10, 100/130 * కొలత, "blue");
    // గంటల చెయ్యి
    _此处_   గంటకెన్ని_డిగ్రీలు = .1/12;	// = నిమిషానికెన్ని_డిగ్రీలు / 12 గంటలు 
    _此处_   గంటలుInక్షణములు = ((గంటలు % 12) * 3600) + నిమిషములుInక్షణములు;
    చెయ్యి(గంటలుInక్షణములు * గంటకెన్ని_డిగ్రీలు, 10, 60/130 * కొలత, "green");
}

// 时钟ను పునరావృతము చేయుటకు
_步骤_     时钟() {
   擦除画布();
   కొలత = .9 *  Math.min( 最大_X_值(), 最大_Y_值())
   అంకెలు(0, 0, 110/130 * కొలత);
   改变颜色为("lightgreen");
   改变位置(0,0);
   宽度(1/130* కొలత)
   圆形(130/130 * కొలత );
   క్షణముల_గీతలు(0, 0, 130/130 * కొలత );
   _此处_  సమయము = new Date();
   చేతులు(సమయము.getHours(), సమయము.getMinutes(), సమయము.getSeconds());
}

_步骤_     演示() {
   初始状态();
   隐藏笔刷();
   播放(时钟,1000); // 时钟ను ప్రతి క్షణము పునరావృతము చేయ వలెను.
}
