// 砖墙

_总是_    高度 = 15
_总是_    宽度 = 2* 高度 


砖块_ = ( 高度, 宽度, 砖块颜色) => {
  开始绘制形状()
  重复 (2, () => {
    向前移动( 宽度)
    向右转(90)
    向前移动( 高度)
    向右转(90)
  })
  停止绘制形状( 砖块颜色)
  向前移动( 宽度)
}

_步骤_     演示() {
  初始状态()
 
  yB = 最大_Y_值()
  xB = 最小_X_值()
  不要添加轮廓()
  向右转( 90)
  更改颜色( 7 ) // 白色

  当_时重复( () => 当前位置().y > 最小_Y_值(), () => {
    위치_변경(xB, yB)
    当_时重复( () => 当前位置().x < 最大_X_值(), () => {
      放下笔刷()
      砖块_(高度, 宽度, "darkred")
      抬起笔刷()
    } )
    yB = yB - 高度

    위치_변경(xB - 宽度/2, yB)
    当_时重复( () => 当前位置().x < 最大_X_值(), () => {
      放下笔刷()
      砖块_(高度, 宽度, "darkred")
      抬起笔刷()
    } )
    yB = yB - 高度
  } )
}