// Random Stars -- draw stars randomly on the canvas

_విధానము_     star (side, sColor) {
  కుంచికను_పైకి_ఎత్తు()
  ముందుకు_జరుగు(.54*side)
  turn (180-18)
  కుంచికను_కింద_పెట్టు()
  _సర్వత్ర_   i=0
  ఆకారము_ప్రారంభించు()
  while (i<5){
    ముందుకు_జరుగు(side)
    కుడి_వైపు_తిరుగు(180-36)
    i = i + 1
  }
  ఆకారము_ముగించు(sColor)
  turn (180+18)
}


_విధానము_     ప్రదర్శన() {
  ఆది_స్థితి()
  for (i=1; i< 150; i=i+1) {
    స్థానము_మార్చు(యాదృచ్ఛిక_సంఖ్య(కనిష్ఠX(),గరిష్ఠX()), యాదృచ్ఛిక_సంఖ్య( కనిష్ఠY(),గరిష్ఠY()))
    ఎడమ_వైపు_తిరుగు(యాదృచ్ఛిక_సంఖ్య(359))
    star (యాదృచ్ఛిక_సంఖ్య(2,15), యాదృచ్ఛిక_సంఖ్య(15))
  }
  కుంచికను_దాచు()
}
