// Square Lines -- draw a set of overlapping squares without turns

_విధానము_     ప్రదర్శన() {
  ఆది_స్థితి()
   చుట్టొద్దు()
  side = 30
  side2 = side + side
  offset = true
  for (_సర్వత్ర_   i=కనిష్ఠY(); i<గరిష్ఠY(); i = i + side) {
    స్థానము_మార్చు(కనిష్ఠX(),i)
    కోణము(90)
    if (offset) {
      కుంచికను_పైకి_ఎత్తు()
      ముందుకు_జరుగు( side)
      కుంచికను_కింద_పెట్టు()
    }
    offset = !offset
    for (_సర్వత్ర_   j=కనిష్ఠX(); j<గరిష్ఠX(); j = j + 3*side) {
      ముందుకు_జరుగు( side2)
      కుంచికను_పైకి_ఎత్తు()
      ముందుకు_జరుగు( side)
      కుంచికను_కింద_పెట్టు()
    }
  }

  offset = true
  for (_సర్వత్ర_   i=కనిష్ఠX(); i<గరిష్ఠX(); i = i + side) {
    స్థానము_మార్చు(i, కనిష్ఠY())
    కోణము(0)
    if (offset) {
      ముందుకు_జరుగు( side)
    }
    offset = !offset
    for (_సర్వత్ర_   j=గరిష్ఠY(); j>కనిష్ఠY(); j = j - 3*side) {
      కుంచికను_పైకి_ఎత్తు()
      ముందుకు_జరుగు( side)
      కుంచికను_కింద_పెట్టు()
      ముందుకు_జరుగు( side2)
    }
  }
}
