// Basket Weave Tessellation -- tile a space using basket weave pattern

// this assumes that the చిన్న సమచతురస్రము is 1/2 of the larger సమచతురస్రము.
// that need not be the case

const సమచతురస్రభుజము = 20
const ఎత్తు = 2.5 * సమచతురస్రభుజము
const వెడల్పు = ఎత్తు + 2 * సమచతురస్రభుజము

నిలువు_దీర్ఘచతురస్రము = ( ఎత్తు, వెడల్పు, వర్ణము) => {
  ఆకారము_ప్రారంభించు()
  ఆవర్తించు (2, () => {
    ముందుకు_జరుగు( ఎత్తు)
    కుడి_వైపు_తిరుగు(90)
    ముందుకు_జరుగు( వెడల్పు)
    కుడి_వైపు_తిరుగు(90)
  } );
  ఆకారము_ముగించు( వర్ణము)
  ముందుకు_జరుగు( ఎత్తు)
}

అడ్డ_దీర్ఘచతురస్రము = ( ఎత్తు, వెడల్పు, వర్ణము) => {
  ఆకారము_ప్రారంభించు()
  ఆవర్తించు (2, () => {
    ముందుకు_జరుగు( వెడల్పు)
    కుడి_వైపు_తిరుగు(90)
    ముందుకు_జరుగు( ఎత్తు)
    కుడి_వైపు_తిరుగు(90)
  } )
  ఆకారము_ముగించు( వర్ణము)
  ముందుకు_జరుగు( వెడల్పు)
}

సమచతురస్రము = ( భుజము, వర్ణము) => {
  ఆకారము_ప్రారంభించు()
  ఆవర్తించు (4, () => {
    ముందుకు_జరుగు( భుజము)
    కుడి_వైపు_తిరుగు(90)
  })
  ఆకారము_ముగించు( వర్ణము)
  ముందుకు_జరుగు( భుజము)
}

ప్రదర్శన = () =>  {
  ఆది_స్థితి()
  let yB = గరిష్ఠY() + సమచతురస్రభుజము
  let xB = కనిష్ఠX()
  చుట్టొద్దు()
  కుడి_వైపు_తిరుగు( 90)

  యావత్_పరిక్రమ( () => కుంచిక.స్థానము.y > కనిష్ఠY(), () =>  {
    స్థానము_మార్చు(xB, yB);
    యావత్_పరిక్రమ( () => కుంచిక.స్థానము.x < గరిష్ఠX(), () => {
      కలమును_కింద_పెట్టు()
      సమచతురస్రము(సమచతురస్రభుజము, "yellow")
      కలమును_పైకి_ఎత్తు()
      ముందుకు_జరుగు( ఎత్తు)
      కలమును_కింద_పెట్టు()
      సమచతురస్రము(సమచతురస్రభుజము, "yellow")
      నిలువు_దీర్ఘచతురస్రము(ఎత్తు, వెడల్పు, "lightblue")
    } );
    yB = yB - సమచతురస్రభుజము

    స్థానము_మార్చు(xB, yB)
    యావత్_పరిక్రమ( () => కుంచిక.స్థానము.x < గరిష్ఠX(), () => {
      కలమును_కింద_పెట్టు()
      అడ్డ_దీర్ఘచతురస్రము(ఎత్తు, వెడల్పు, "red")
      కలమును_పైకి_ఎత్తు()
      ముందుకు_జరుగు( ఎత్తు)
    } )
    yB = yB - ఎత్తు

    స్థానము_మార్చు(xB, yB)
    యావత్_పరిక్రమ( () => కుంచిక.స్థానము.x < గరిష్ఠX(), () => {
      కలమును_కింద_పెట్టు()
      సమచతురస్రము(సమచతురస్రభుజము, "yellow")
      నిలువు_దీర్ఘచతురస్రము(ఎత్తు, వెడల్పు, "lightblue")
      సమచతురస్రము(సమచతురస్రభుజము, "yellow")
      కలమును_పైకి_ఎత్తు()
      ముందుకు_జరుగు( ఎత్తు)
      కలమును_కింద_పెట్టు()
    } )
    yB = yB - సమచతురస్రభుజము

    స్థానము_మార్చు(xB- వెడల్పు +సమచతురస్రభుజము, yB)
    యావత్_పరిక్రమ( () => కుంచిక.స్థానము.x < గరిష్ఠX(), () => {
      కలమును_కింద_పెట్టు()
      అడ్డ_దీర్ఘచతురస్రము(ఎత్తు, వెడల్పు, "red")
      కలమును_పైకి_ఎత్తు()
      ముందుకు_జరుగు(ఎత్తు)
    } )
    yB = yB - ఎత్తు
  } )
}
