// Basket Weave Tessellation -- tile a space using basket weave pattern

// this assumes that the smaller సమచతురస్రము is 1/2 of the larger సమచతురస్రము.
// that need not be the case

const small = 20
const sSide = 2.5 * small
const lSide = sSide + 2 * small

vRect = ( sSide, lSide, fColor) => {
  ఆకారము_ప్రారంభించు()
  లెక్క_పెడుతూ_ఆవర్తించు (2, (i) => {
    ముందుకు_జరుగు( sSide)
    కుడి_వైపు_తిరుగు(90)
    ముందుకు_జరుగు( lSide)
    కుడి_వైపు_తిరుగు(90)
  } );
  ఆకారము_ముగించు( fColor)
  ముందుకు_జరుగు( sSide)
}

hRect = ( sSide, lSide, fColor) => {
  ఆకారము_ప్రారంభించు()
  లెక్క_పెడుతూ_ఆవర్తించు (2, (i) => {
    ముందుకు_జరుగు( lSide)
    కుడి_వైపు_తిరుగు(90)
    ముందుకు_జరుగు( sSide)
    కుడి_వైపు_తిరుగు(90)
  } )
  ఆకారము_ముగించు( fColor)
  ముందుకు_జరుగు( lSide)
}

సమచతురస్రము = ( భుజము, fColor) => {
  ఆకారము_ప్రారంభించు()
  లెక్క_పెడుతూ_ఆవర్తించు (4, (i) => {
    ముందుకు_జరుగు( భుజము)
    కుడి_వైపు_తిరుగు(90)
  })
  ఆకారము_ముగించు( fColor)
  ముందుకు_జరుగు( భుజము)
}

ప్రదర్శన = () =>  {
  ఆది_స్థితి()
  let yB = గరిష్ఠY() + small
  let xB = కనిష్ఠX()
  చుట్టొద్దు()
  కుడి_వైపు_తిరుగు( 90)

  యావత్_పరిక్రమ( () => కుంచిక.స్థానము.y > కనిష్ఠY(), () =>  {
    స్థానము_మార్చు(xB, yB);
    యావత్_పరిక్రమ( () => కుంచిక.స్థానము.x < గరిష్ఠX(), () => {
      కలమును_కింద_పెట్టు()
      సమచతురస్రము(small, "పసుపు")
      కలమును_పైకి_ఎత్తు()
      ముందుకు_జరుగు( sSide)
      కలమును_కింద_పెట్టు()
      సమచతురస్రము(small, "పసుపు")
      vRect(sSide, lSide, "lightblue")
    } );
    yB = yB - small

    స్థానము_మార్చు(xB, yB)
    యావత్_పరిక్రమ( () => కుంచిక.స్థానము.x < గరిష్ఠX(), () => {
      కలమును_కింద_పెట్టు()
      hRect(sSide, lSide, "red")
      కలమును_పైకి_ఎత్తు()
      ముందుకు_జరుగు( sSide)
    } )
    yB = yB - sSide

    స్థానము_మార్చు(xB, yB)
    యావత్_పరిక్రమ( () => కుంచిక.స్థానము.x < గరిష్ఠX(), () => {
      కలమును_కింద_పెట్టు()
      సమచతురస్రము(small, "పసుపు")
      vRect(sSide, lSide, "lightblue")
      సమచతురస్రము(small, "పసుపు")
      కలమును_పైకి_ఎత్తు()
      ముందుకు_జరుగు( sSide)
      కలమును_కింద_పెట్టు()
    } )
    yB = yB - small

    స్థానము_మార్చు(xB- lSide +small, yB)
    యావత్_పరిక్రమ( () => కుంచిక.స్థానము.x < గరిష్ఠX(), () => {
      కలమును_కింద_పెట్టు()
      hRect(sSide, lSide, "red")
      కలమును_పైకి_ఎత్తు()
      ముందుకు_జరుగు(sSide)
    } )
    yB = yB - sSide
  } )
}
