// గోడ గడియారము

_సర్వత్ర_   కొలత;

// గడియారము చుట్టూ క్షణముల గీతలు గీయుటకు
_విధానము_     క్షణముల_గీతలు(x, y, వ్యాసార్థము) {
   _అత్ర_   గిత_పొడవు = 7;
   _అత్ర_   ఖాళీ = వ్యాసార్థము - గిత_పొడవు;
   రంగు_మార్చు( నీలము );
   వెడల్పు(1);
   లెక్క_పెడుతూ_ఆవర్తించు( 60, ( కో ) => {
      _అత్ర_ థీటా = కో * 6;
      // ప్రతి  ఐదవది దళసరి గా వేయవలెను
      వెడల్పు( ( ( కో % 5 ) ? 1 : 3)/130* కొలత)
      కుంచికను_పైకి_ఎత్తు();
      స్థానము_మార్చు(0,0);
      కోణము(థీటా);
      ముందుకు_జరుగు(ఖాళీ);
      కుంచికను_కింద_పెట్టు();
      ముందుకు_జరుగు(గిత_పొడవు);
   });
   
}


// గంటలు, నిమిషాలూ సూచించే అంకెలు
_విధానము_     అంకెలు(x, y, వ్యాసార్థము) {
   కుంచికను_పైకి_ఎత్తు();
   _అత్ర_  అక్షర_పరిమాణము = 20/130 * కొలత
   అక్షరరూపము_స్థాపించు(అక్షర_పరిమాణము+"px sans-serif");
   రంగు_మార్చు("నలుపు");
   లెక్క_పెడుతూ_ఆవర్తించు( 12, ( గంట ) =>{
      స్థానము_మార్చు(x,y);
      కోణము(గంట * 30);
      ముందుకు_జరుగు(వ్యాసార్థము); // to center of digit
      కోణము(180);
      ముందుకు_జరుగు(10/130 * కొలత); // vertical correction to baseline
      కుడి_వైపు_తిరుగు(90);
      if (గంట < 10) {
        ముందుకు_జరుగు(6/130 * కొలత); // horizontal correction to lower left corner
      } else {
        ముందుకు_జరుగు(10/130 * కొలత)
      }
      కుడి_వైపు_తిరుగు(180);
      వ్రాయి(గంట);
   })
   కుంచికను_కింద_పెట్టు();
}

// చేతులు గీయుటకు
_విధానము_     చెయ్యి (థీటా, w, పొడవు, రంగు) {
   _అత్ర_   stepకొలత = 5;
   _అత్ర_   widthDelta = w / (పొడవు / stepకొలత);
   స్థానము_మార్చు(0, 0);
   కోణము(థీటా);
   రంగు_మార్చు(రంగు);
   for (_సర్వత్ర_   step = 0; step < పొడవు; step = step + stepకొలత) 
   // లెక్క_పెడుతూ_ఆవర్తించు( పొడవు, ( అడుగు) => 
   {
      వెడల్పు(w);
      ముందుకు_జరుగు(stepకొలత);
      w = w - widthDelta;
   }
   //);
}

_విధానము_     చేతులు(గంటలు, నిమిషములు, క్షణములు) {
    // క్షణముల చెయ్యి
    _అత్ర_   secDegreesPerSecond = 6;	// = 360 degrees/60 క్షణములు /minute
    చెయ్యి(క్షణములు * secDegreesPerSecond, 4, 100/130 * కొలత, "red");
    // నిమిషముల చెయ్యి 
    _అత్ర_   minDegreePerSecond = 0.1;	// = 360 degrees /3600 క్షణములు /గంట
    _అత్ర_   నిమిషములుInక్షణములు = నిమిషములు * 60 + క్షణములు;
    చెయ్యి(నిమిషములుInక్షణములు * minDegreePerSecond, 10, 100/130 * కొలత, "blue");
    // గంటల చెయ్యి
    _అత్ర_   గంటDegreePerSecond = .1/12;	// = 360 degrees /3600 క్షణములు per గంట /12 గంటలు per half day /half day
    _అత్ర_   గంటలుInక్షణములు = ((గంటలు % 12) * 3600) + నిమిషములుInక్షణములు;
    చెయ్యి(గంటలుInక్షణములు * గంటDegreePerSecond, 10, 60/130 * కొలత, "blue");
}

// refresh the entire గడియారము
_విధానము_     గడియారము() {
   చెరిపి_వేయి();
   కొలత = .9 *  Math.min( గరిష్ఠX(), గరిష్ఠY())
  అంకెలు(0, 0, 110/130 * కొలత);
   రంగు_మార్చు("lightgreen");
   స్థానము_మార్చు(0,0);
   వెడల్పు(1/130* కొలత)
   వృత్తము(130/130 * కొలత );
   క్షణముల_గీతలు(0, 0, 130/130 * కొలత );
   _అత్ర_  సమయము = new Date();
   చేతులు(సమయము.getHours(), సమయము.getMinutes(), సమయము.getSeconds());
}

_విధానము_     ప్రదర్శన() {
   కుంచికను_దాచు();
   // ప్రతి క్షణము గడియారమును పునరావృతము చేయ వలెను.
   ఆడించు(గడియారము,1000);
}
