// Collidescape (tm) -- aperiodic tiling researched by Ward Hollins.
// angles for the two isosceles triangles are: 
// 36, 72, 72 and 36, 36, 108 ..degrees
//  1,2,2 and 1,1,3 times pi/5 .. radians
ang = 360/10 // the basic కోణము (pi/5 radians)
side = 50 // length of the common side of the isosceles triangles
bBase = 2* side * Math.cos( degToRad( ang)) // length of big base
sBase = 2* side * Math.sin( degToRad( ang/2)) // length of small base


function bb (fColor) { //big piece, big కోణము
    ఆకారాము_ప్రారంభించు()
    ముందుకు_జరుగు( side)
    కుడి_వైపు_తిరుగు( 4 * ang)
    ముందుకు_జరుగు( bBase)
    కుడి_వైపు_తిరుగు( 4 * ang)
    ముందుకు_జరుగు( side)
    కుడి_వైపు_తిరుగు( 180)
    ఆకారాము_ముగించు( fColor)
}


function bs (fColor) { // big piece, small కోణము
    ఆకారాము_ప్రారంభించు()
    ముందుకు_జరుగు( side)
    కుడి_వైపు_తిరుగు( 2 * ang)
    ముందుకు_జరుగు( side)
    కుడి_వైపు_తిరుగు( 4 * ang)
    ముందుకు_జరుగు( bBase)
    కుడి_వైపు_తిరుగు( 180)
    ఆకారాము_ముగించు( fColor)
}


function bs2 (fColor) { // big piece, small కోణము other corner
    ఆకారాము_ప్రారంభించు()
    ముందుకు_జరుగు( bBase)
    కుడి_వైపు_తిరుగు( 4 * ang)
    ముందుకు_జరుగు( side)
    కుడి_వైపు_తిరుగు( 2 * ang)
    ముందుకు_జరుగు( side)
    కుడి_వైపు_తిరుగు( 180)
    ఆకారాము_ముగించు( fColor)
}


function ss (fColor) { // small piece, small కోణము
    ఆకారాము_ప్రారంభించు()
    ముందుకు_జరుగు( side)
    కుడి_వైపు_తిరుగు( 3 * ang)
    ముందుకు_జరుగు( sBase)
    కుడి_వైపు_తిరుగు( 3 * ang)
    ముందుకు_జరుగు( side)
    కుడి_వైపు_తిరుగు( 180)
    ఆకారాము_ముగించు( fColor)
}


function sb (fColor) { // small piece, big కోణము
    ఆకారాము_ప్రారంభించు()
    ముందుకు_జరుగు( sBase)
    కుడి_వైపు_తిరుగు( 3 * ang)
    ముందుకు_జరుగు( side)
    కుడి_వైపు_తిరుగు( 4 * ang)
    ముందుకు_జరుగు( side)
    కుడి_వైపు_తిరుగు( 180)
    ఆకారాము_ముగించు( fColor)
}


function sb2 (fColor) { // small piece, big కోణము other corner
    ఆకారాము_ప్రారంభించు()
    ముందుకు_జరుగు( side)
    కుడి_వైపు_తిరుగు( 4 * ang)
    ముందుకు_జరుగు( side)
    కుడి_వైపు_తిరుగు( 3 * ang)
    ముందుకు_జరుగు( sBase)
    కుడి_వైపు_తిరుగు( 180)
    ఆకారాము_ముగించు( fColor)
}


function spiral( ) {
// function draws a spiral using only two isosceles triangles
// this is done with a series of points. Each point starts at the
// center of the spiral and moves to the point where several triangles
// are drawn. This technique isolates changes, but is less efficient
// overall.
//
// Numbers for each point can be included by uncommenting the "//write"
// statements.

    c1 = "yellow"
    c2 = "blue"
    for (var i=0; i<5; i++) {
//point0:
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు( (i * 2 + 1) * ang)
        bs( c2)

//point1:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు( (i * 2 + 1) * ang)
        ముందుకు_జరుగు( bBase)
	కలమును_కింద_పెట్టు()

        bs( c2)
        bs( c2)
        bs2( c1)
        sb2( c1)
        bs2( c1)
        ss( c2)
        bb( c2)
        //వ్రాయి( "1")

//point2:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు( (i * 2 + 1) * ang)
        bs( c2)
        ముందుకు_జరుగు( bBase + side)
        ఎడమ_వైపు_తిరుగు( 3 * ang)
	కలమును_కింద_పెట్టు()

        ss( c2)
        ss( c2)
        bb( c2)
        //వ్రాయి( "2")

//point3:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు( (i +1) * 2* ang)
        ముందుకు_జరుగు( bBase + side)
        ఎడమ_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side)
        ఎడమ_వైపు_తిరుగు( 2 * ang)
	కలమును_కింద_పెట్టు()

        bs( c1)
        bs2( c1)
        ss( c1)
        ss( c1)
        bs( c1)
        //వ్రాయి( "3")

//point4:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు( i * 2 * ang)
        ముందుకు_జరుగు( bBase)
        కుడి_వైపు_తిరుగు(ang)

	కలమును_కింద_పెట్టు()
        bs( c1)
        ఎడమ_వైపు_తిరుగు( ang)

	కలమును_పైకి_ఎత్తు()
        ముందుకు_జరుగు( bBase)
	కలమును_కింద_పెట్టు()

        bs( c2)
        sb( c1)
        sb2( c1)
        bs2( c1)
        bs( c2)
        bs2( c2)
        ss( c2)
        ss( c2)
        //వ్రాయి( "4")

//point5:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు( (i +1) * 2* ang)
        ముందుకు_జరుగు( bBase + side)
        ఎడమ_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side + side + sBase)
        ఎడమ_వైపు_తిరుగు( 2 * ang)
	కలమును_కింద_పెట్టు()

        bs2( c2)
        sb2( c2)
        sb( c2)
        sb2( c2)
        sb( c2)
        //వ్రాయి( "5")

//point6:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు( i * 2* ang)
        ముందుకు_జరుగు(  bBase + side + bBase)
        ఎడమ_వైపు_తిరుగు( 3 * ang)
	కలమును_కింద_పెట్టు()

        bs2( c1)
        bb( c1)
        bs( c1)
        bs2( c1)
        bb( c1)
        //వ్రాయి( "6")

//point7:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు(( i + 1)* 2 * ang)
        ముందుకు_జరుగు(  bBase + side)
        ఎడమ_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side + side)
        కుడి_వైపు_తిరుగు( 2* ang)
        ముందుకు_జరుగు( side)
        ఎడమ_వైపు_తిరుగు( 3 * ang)
	కలమును_కింద_పెట్టు()

        sb2( c2)
        sb( c2)
        ss( c2)
        bb( c2)
        //వ్రాయి( "7")

//point8:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు(( i + 1)* 2 * ang)
        ముందుకు_జరుగు(  bBase + side)
        ఎడమ_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side + side)
        కుడి_వైపు_తిరుగు( 3 * ang)
        ముందుకు_జరుగు( bBase + side)
	కలమును_కింద_పెట్టు()

        ss( c2)
        sb2( c2)
        sb( c2)
        ss( c2)
        sb2( c2)
        sb( c2)
        //వ్రాయి( "8")

//point9:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు( i * 2* ang)
        ముందుకు_జరుగు(  bBase + side + bBase) //@6
        ఎడమ_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side)
        కుడి_వైపు_తిరుగు( ang)
        ముందుకు_జరుగు( sBase + sBase)
        కుడి_వైపు_తిరుగు( 3 * ang)
	కలమును_కింద_పెట్టు()

        sb2( c2)
        sb( c2)
        bb( c1)
        ss( c1)
        bs( c1)
        bs2( c1)
        //వ్రాయి( "9")

//point10:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు( i * 2 * ang)
        ముందుకు_జరుగు(  bBase + side + bBase) //@6
        కుడి_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( bBase)
        ఎడమ_వైపు_తిరుగు( 4 * ang)
	కలమును_కింద_పెట్టు()

        sb2( c1)
        sb( c1)
        sb2( c1)
        sb( c1)
        //వ్రాయి( "10")

//point11:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు( i * 2 * ang)
        ముందుకు_జరుగు(  bBase + side + bBase) //@6
        కుడి_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( bBase + side)
        కుడి_వైపు_తిరుగు( 1 * ang)
        ముందుకు_జరుగు( side)
	కలమును_కింద_పెట్టు()

        bb( c1)
        bs( c1)
        bs2( c1)
        //వ్రాయి( "11")

//point12:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు( i * 2 * ang)
        ముందుకు_జరుగు(  bBase + side + bBase) //@6
        కుడి_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( bBase + side)
        కుడి_వైపు_తిరుగు( ang)
        ముందుకు_జరుగు( side) // @11
        ముందుకు_జరుగు(side)
	కలమును_కింద_పెట్టు()

        bb( c1)
        bs( c1)
        //వ్రాయి( "12")

//point13:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు(( i + 1)* 2 * ang)
        ముందుకు_జరుగు(  bBase + side)
        ఎడమ_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side + side)
        కుడి_వైపు_తిరుగు( 3 * ang)
        ముందుకు_జరుగు( bBase + side) //@8
        కుడి_వైపు_తిరుగు( ang)
        ముందుకు_జరుగు( side)
        ఎడమ_వైపు_తిరుగు( 3 * ang)
	కలమును_కింద_పెట్టు()

        sb( c2)
        bs( c2)
        bs2( c2)
        bb( c2)
        //వ్రాయి( "13")

//point14:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు( (i +1) * 2 * ang)
        ముందుకు_జరుగు( bBase + side)
        ఎడమ_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side + side + sBase) // @5
        ఎడమ_వైపు_తిరుగు(  ang)
        ముందుకు_జరుగు( side)
        కుడి_వైపు_తిరుగు( 2* ang)
        ముందుకు_జరుగు( side + side)
	కలమును_కింద_పెట్టు()

        bs( c1)
        bs2( c1)
        bb( c2)
        bs( c2)
        bs2( c2)
        bb( c1)
        //వ్రాయి( "14")

//point15:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు(( i + 1)* 2 * ang)
        ముందుకు_జరుగు(  bBase + side)
        ఎడమ_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side + side)
        కుడి_వైపు_తిరుగు( 3 * ang)
        ముందుకు_జరుగు( bBase + side) //@8
        కుడి_వైపు_తిరుగు( ang)
        ముందుకు_జరుగు( side) //@13
        ముందుకు_జరుగు( bBase)
        ఎడమ_వైపు_తిరుగు( ang)
        ముందుకు_జరుగు( side)
	కలమును_కింద_పెట్టు()

        bs( c2)
        bs2( c2)
        bb( c1)
        bs( c1)
        bs2( c1)
        bb( c2)
        //వ్రాయి( "15")

//point16:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు( i * 2* ang)
        ముందుకు_జరుగు(  bBase + side + bBase) //@6
        ఎడమ_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side)
        కుడి_వైపు_తిరుగు( ang)
        ముందుకు_జరుగు( sBase + sBase) //@9
        కుడి_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( bBase)
        కుడి_వైపు_తిరుగు( ang)
        ముందుకు_జరుగు( side)
        ఎడమ_వైపు_తిరుగు( 2* ang)
	కలమును_కింద_పెట్టు()

        bs( c2)
        bs2( c2)
        bb( c1)
        bs( c1)
        bs2( c1)
        bb( c2)
        //వ్రాయి( "16")

//point17:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు( i * 2* ang)
        ముందుకు_జరుగు(  bBase + side + bBase) //@6
        ఎడమ_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side)
        కుడి_వైపు_తిరుగు( ang)
        ముందుకు_జరుగు( sBase + sBase) //@9
        కుడి_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( bBase)
        కుడి_వైపు_తిరుగు( ang)
        ముందుకు_జరుగు( side) //@16
        ముందుకు_జరుగు( side)
        ఎడమ_వైపు_తిరుగు( 2 * ang)
	కలమును_కింద_పెట్టు()

        ss( c2)
        sb2( c2)
        sb( c1)
        bs( c1)
        //వ్రాయి( "17")

//point18:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు( (i +1) * 2 * ang)
        ముందుకు_జరుగు( bBase + side)
        ఎడమ_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side + side + sBase) // @5
        ఎడమ_వైపు_తిరుగు(  ang)
        ముందుకు_జరుగు( side)
        కుడి_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side + side) //@14
        కుడి_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side) //@ intermediate point
        కుడి_వైపు_తిరుగు( 3 * ang)
	కలమును_కింద_పెట్టు()

        bs( c2)
        కుడి_వైపు_తిరుగు( 4 * ang)
        //వ్రాయి( "14b")
        bs( c1)
        కుడి_వైపు_తిరుగు( 1 * ang)

	కలమును_పైకి_ఎత్తు
        ముందుకు_జరుగు( side)
	కలమును_కింద_పెట్టు()

        bb( c2)
        bs( c2)
        bs2( c2)
        bb( c1)
        bs( c1)
        bs2( c1)
        //వ్రాయి( "18")

//point19:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు( (i +1) * 2 * ang)
        ముందుకు_జరుగు( bBase + side)
        ఎడమ_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side + side + sBase) // @5
        ఎడమ_వైపు_తిరుగు(  ang)
        ముందుకు_జరుగు( side)
        కుడి_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side + side) //@14
        కుడి_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side + side + side)
        ఎడమ_వైపు_తిరుగు( 2*ang)
	కలమును_కింద_పెట్టు()

        ss( c1)
        sb2( c1)
        sb( c2)
        bs( c2)
        //వ్రాయి( "19")

//point20:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు( (i +1) * 2 * ang)
        ముందుకు_జరుగు( bBase + side)
        ఎడమ_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side + side + sBase) // @5
        ఎడమ_వైపు_తిరుగు(  ang)
        ముందుకు_జరుగు( side)
        కుడి_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side + side) //@14
        కుడి_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side + side + side) //@19
        కుడి_వైపు_తిరుగు( ang)
        ముందుకు_జరుగు( sBase)
        ఎడమ_వైపు_తిరుగు( 3*ang)
	కలమును_కింద_పెట్టు()

        ss( c1)
        sb2( c1)
        sb( c2)
        ss( c2)
        //వ్రాయి( "20")

//point21:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు( (i +1) * 2 * ang)
        ముందుకు_జరుగు( bBase + side)
        ఎడమ_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side + side + sBase) // @5
        ఎడమ_వైపు_తిరుగు(  ang)
        ముందుకు_జరుగు( side)
        కుడి_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side + side) //@14
        కుడి_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side + side + side)
        కుడి_వైపు_తిరుగు( ang)
        ముందుకు_జరుగు( sBase) //@20
        ముందుకు_జరుగు( sBase)
        ఎడమ_వైపు_తిరుగు( 3*ang)
	కలమును_కింద_పెట్టు()

        ss( c1)
        bs( c1)
        bs2( c1)
        bb( c2)
        //వ్రాయి( "21")

//point22:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు( (i +1) * 2 * ang)
        ముందుకు_జరుగు( bBase + side)
        ఎడమ_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side + side + sBase) // @5
        ఎడమ_వైపు_తిరుగు(  ang)
        ముందుకు_జరుగు( side)
        కుడి_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side + side) //@14
        కుడి_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side + side + side)
        కుడి_వైపు_తిరుగు( ang)
        ముందుకు_జరుగు( sBase + sBase) //@21
        ముందుకు_జరుగు( side)
        ఎడమ_వైపు_తిరుగు( 2*ang)
	కలమును_కింద_పెట్టు()

        bs( c1)
        bs2( c1)
        bb( c2)
        bs( c2)
        //వ్రాయి( "22")

//point23:
	కలమును_పైకి_ఎత్తు()
        స్థానము_మార్చు(0,0)
        దిశ_మార్చు( i * 2* ang)
        ముందుకు_జరుగు(  bBase + side + bBase) //@6
        ఎడమ_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( side)
        కుడి_వైపు_తిరుగు( ang)
        ముందుకు_జరుగు( sBase + sBase) //@9
        కుడి_వైపు_తిరుగు( 2 * ang)
        ముందుకు_జరుగు( bBase)
        కుడి_వైపు_తిరుగు( ang)
        ముందుకు_జరుగు( side + side) //@17
        కుడి_వైపు_తిరుగు( ang)
        ముందుకు_జరుగు( sBase)
        ఎడమ_వైపు_తిరుగు( 3 * ang)
	కలమును_కింద_పెట్టు()

        ss( c2)
        bs( c2)
        //వ్రాయి( "23")
   }
}


function demo () {
    ఆది_స్థితి()
     చుట్టు(false)
    కలమును_కింద_పెట్టు()
    spiral( )
}
