// Coordinates -- Draw the axes of the coordinate system on the canvas

_విధానము_     lines () {
  చెరిపి_వేయి()
  కుంచికను_కింద_పెట్టు()

  స్థానము_మార్చు(0,కనిష్ఠY())
  కోణము(0)
  ముందుకు_జరుగు(2*గరిష్ఠY())

  స్థానము_మార్చు(కనిష్ఠX(),0)
  కోణము(90)
  ముందుకు_జరుగు(2*గరిష్ఠX())

  //lable the axes
  అక్షరరూపము_స్థాపించు("bold 14px sans-serif");
  స్థానము_మార్చు(0+10,గరిష్ఠY()-25)
  కోణము (90)
  వ్రాయి(గరిష్ఠY())

  స్థానము_మార్చు(గరిష్ఠX()-5,+10)
  కోణము (0)
  వ్రాయి(గరిష్ఠX())

  స్థానము_మార్చు(10,కనిష్ఠY()+5)
  కోణము (90)
  వ్రాయి(కనిష్ఠY())

  స్థానము_మార్చు(కనిష్ఠX()+25,0+10)
  కోణము (0)
  వ్రాయి(కనిష్ఠX())
}


_విధానము_     ticks (dir, limit, step) {
  _సర్వత్ర_   tickLen = 5
  కోణము(dir)
  స్థానము_మార్చు(0,0)
  కుంచికను_పైకి_ఎత్తు()
  for (i=1; i*step<limit; i=i+1) {

    ముందుకు_జరుగు(step)
    ఎడమ_వైపు_తిరుగు(90)
    if (i%5 == 0) {
      ముందుకు_జరుగు(tickLen)
      కుంచికను_కింద_పెట్టు()
      వెనుకకు_జరుగు(tickLen*2)
      కుంచికను_పైకి_ఎత్తు()
      ముందుకు_జరుగు(tickLen)
      కుడి_వైపు_తిరుగు(90)
    } else {
      ముందుకు_జరుగు(tickLen/2)
      కుంచికను_కింద_పెట్టు()
      వెనుకకు_జరుగు(tickLen)
      కుంచికను_పైకి_ఎత్తు()
      ముందుకు_జరుగు(tickLen/2)
      కుడి_వైపు_తిరుగు(90)
    }
  }
}

_విధానము_     ప్రదర్శన() {
  lines()
  ticks (0, గరిష్ఠY(), 10)
  ticks (90, గరిష్ఠX(), 10)
  ticks (180, -కనిష్ఠY(), 10)
  ticks (270, -కనిష్ఠX(), 10)
}
