// ఒక వృత్తమును వేరే వృత్తములతో విభజినచుట

// *** సార్వత్రికములు ***

// *** నిత్యములు ***
const వ్యాసార్థము = 50; // వృత్తము వ్యాసార్థము
const ఆవర్తన_సంఖ్య = 6; // times to loop
const అవధి = 1000; // మిల్లిసెకన్లు, milliseconds


// *** ప్రక్రియలు ***

విభజినచు = (వృత్తములు, వ్యాసార్థము) => {
  ఎడమ_వైపు_తిరుగు(60);
  ముందుకు_జరుగు(వ్యాసార్థము);
  కుడి_వైపు_తిరుగు(60);
  ఆవర్తించు( 6, () => { // ఒకొక్కటి చొప్పున ఆరు సమీపస్థ వృత్తములు
    కుడి_వైపు_తిరుగు(60);
    ఆవర్తించు(వృత్తములు, () => { 
      ముందుకు_జరుగు(వ్యాసార్థము);
      వృత్తము(వ్యాసార్థము);
    });
  });
}

మెట్టు = (లోతు) => {
  విభజినచు( లోతు, వ్యాసార్థము )
  యది_చేత్( () => (లోతు < ఆవర్తన_సంఖ్య), () => {
    విలంబించు ( () => {మెట్టు(లోతు+1)}, అవధి);
  } );
}


ప్రదర్శన = () => {
  చెరిపి_వేయి();
  కుంచికను_దాచు();
  కేంద్రకమునకు_వెళ్ళు();
  కలమును_పైకి_ఎత్తు();
  చుట్టొద్దు();
  వృత్తము(వ్యాసార్థము);
  విలంబించు ( () => {మెట్టు(0)}, అవధి);
}
