// Example -- example of code
/* Define helper functions here
or write your own functions
including a demo() function

For example:    */


సమ_చతురస్రము = ( భుజము ) => {
  ఆవర్తించు(4, () => {
    ముందుకు_జరుగు( భుజము );
    కుడి_వైపు_తిరుగు(90);
  });
}

demo = () => {
  కుంచికను_దాచు();
  రంగు_మార్చు( నీలము );
  let భుజము = 100;
  let రంగు_సంఖ్య = 0;
  యావత్_పరిక్రమ( () => భుజము > 0, ()=> {
    సమ_చతురస్రము( భుజము );
    కుడి_వైపు_తిరుగు(36);
    భుజము = భుజము - 10;
    రంగు_సంఖ్య = ( రంగు_సంఖ్య + 1 ) % 16;
    రంగు_మార్చు( రంగు_సంఖ్య );
  } );
}
