// Graphitti -- draw randomly placed coloured stripes

//** Globals **

_సర్వత్ర_   గరిష్ఠ_X =  imageContext.canvas.width/2;
_సర్వత్ర_   గరిష్ఠ_Y =  imageContext.canvas.height/2;
_సర్వత్ర_   కనిష్ఠ_X =  -గరిష్ఠ_X;
_సర్వత్ర_   కనిష్ఠ_Y =  -గరిష్ఠ_Y;
_సర్వత్ర_   maxVelocity = 12;


_విధానము_     plotOne() {
  స్థానము_మార్చు(యాదృచ్ఛిక_సంఖ్య(కనిష్ఠ_X, గరిష్ఠ_X), యాదృచ్ఛిక_సంఖ్య(కనిష్ఠ_Y, గరిష్ఠ_Y));
  రంగు_మార్చు(యాదృచ్ఛిక_సంఖ్య(16));
  కోణము(యాదృచ్ఛిక_సంఖ్య(0, 180));
  వెడల్పు(యాదృచ్ఛిక_సంఖ్య(1, 20));
  ముందుకు_జరుగు(యాదృచ్ఛిక_సంఖ్య(10, 30));
}

_విధానము_     ప్రదర్శన() {
  ఆది_స్థితి()
  ఆడించు(plotOne, 20);
}
