// Stamps -- demonstrate stamping of a star design multiple times

_విధానము_     star (side) {
  కుంచికను_పైకి_ఎత్తు()
  ముందుకు_జరుగు(.54*side)
  turn (180-18)
  కుంచికను_కింద_పెట్టు()
  _సర్వత్ర_   i=0
  while (i<5){
    ముందుకు_జరుగు(side)
    కుడి_వైపు_తిరుగు(180-36)
    i = i + 1
  }
  turn (180+18)
}

_విధానము_     stamps () {
  ఆది_స్థితి()
   చుట్టొద్దు()
  _సర్వత్ర_   x = కనిష్ఠX()
  while (x <= గరిష్ఠX()) {
    _సర్వత్ర_   y = కనిష్ఠY()
    while (y <= గరిష్ఠY()) {
      స్థానము_మార్చు(x,y)
      కోణము (0);
      star (25);
      y = y+30
    }
    x = x+30
  }
}

  
ప్రదర్శన = stamps
