// త్రిభుజ_ప్రస్తారము -- త్రిభుజములతో నేలను నింపుట

_సర్వత్ర_ రంగులు = [ "ఎరుపు", "white", "blue", "yellow", "green"]


_విధానము_      ఊర్ధ్వముఖ_త్రిభుజము( భుజము, రంగు) {
  ఆకారము_ప్రారంభించు()
  లెక్క_పెడుతూ_ఆవర్తించు( 3 , (_) => {
    ముందుకు_జరుగు( భుజము)
    ఎడమ_వైపు_తిరుగు( 120)
  } );
  ఆకారము_ముగించు( రంగు)
}

_విధానము_     అధోముఖ_త్రిభుజము( భుజము, రంగు) {
  ఆకారము_ప్రారంభించు()
  లెక్క_పెడుతూ_ఆవర్తించు( 3 , (_) => {
    ముందుకు_జరుగు( భుజము)
    కుడి_వైపు_తిరుగు( 120)
  } );
  ఆకారము_ముగించు( రంగు)
}
_విధానము_     రంగు_మార్చు( స) { 
  ర = రంగులు[ స % రంగులు.length]
  _ఫలము_  ర
}

_విధానము_     ప్రదర్శన() {
  ఆది_స్థితి()
  _అత్ర_  భుజము = 50;  
  _అత్ర_  స = 0;
  _అత్ర_ అంతరము = భుజము/3 // వరుసల మధ్య అతరము
  చుట్టొద్దు()
  స్థానము_మార్చు(కనిష్ఠX(), గరిష్ఠY())
  కుడి_వైపు_తిరుగు( 90)

  యావత్_పరిక్రమ( () => కుంచిక.స్థానము.y > కనిష్ఠY(), ()=> {
    యావత్_పరిక్రమ( () => కుంచిక.స్థానము.x < గరిష్ఠX(),()=> {
      అధోముఖ_త్రిభుజము(భుజము, రంగు_మార్చు(స))
      స = స + 1;
      ముందుకు_జరుగు(భుజము)
    } );
    కుడి_వైపు_తిరుగు(120)
    ముందుకు_జరుగు( భుజము)
    కుడి_వైపు_తిరుగు(60)
    యావత్_పరిక్రమ( () => కుంచిక.స్థానము.x > కనిష్ఠX(), ()=> {
      అధోముఖ_త్రిభుజము(భుజము, రంగు_మార్చు(స))
      స = స + 1;
      ముందుకు_జరుగు(భుజము)
    } );

    ఎడమ_వైపు_తిరుగు(180)
    ముందుకు_జరుగు(అంతరము)
    } );
}
