
कनिष्ठं_चिनु = Math.min

_विधानम्_     कोख्_रेखा (दैर्घ्यम्‌, गहनता) {
    यदि_तर्हि_अन्यथा( () => (गहनता == 0),
   () => {    अग्रे_गच्छतु(दैर्घ्यम्‌);  },
   () => {
    // वामपर्वतः 
    कोख्_रेखा (दैर्घ्यम्‌/3, गहनता-1);
    वामं_वर्तस्व(60); 
    कोख्_रेखा (दैर्घ्यम्‌/3, गहनता-1);
    दक्षिणं_वर्तस्व(120); 
    कोख्_रेखा (दैर्घ्यम्‌/3, गहनता-1);
    वामं_वर्तस्व(60); 
    कोख्_रेखा (दैर्घ्यम्‌/3, गहनता-1);
  } )
}


_विधानम्_     कोख्_हिमदलः (दैर्घ्यम्‌, गहनता) {
  दिशाम्_परिवर्तय (30);
  स्थानम्_परिवर्तय(-दैर्घ्यम्‌/2,-.3 * दैर्घ्यम्‌);
  कोख्_रेखा (दैर्घ्यम्‌, गहनता);
  दक्षिणं_वर्तस्व(120);
  कोख्_रेखा (दैर्घ्यम्‌, गहनता);
  दक्षिणं_वर्तस्व(120);
  कोख्_रेखा (दैर्घ्यम्‌, गहनता);
  दक्षिणं_वर्तस्व(120);
}

वर्ण_हिमदलानि = ()=> {
  दलवर्णाः.push(यादृच्छिकसङ्ख्या(15) );
  दलवर्णाः.shift();
  गणयन्_आवर्तय (6, ( क ) => {
    वर्णं_परिवर्तय( दलवर्णाः [क] );
    कोख्_हिमदलः( दैर्घ्यम्‌ * (क+1) * (क+1), क)
  } );
}

_विधानम्_     प्रदर्शन() {
  आदिस्थितिः()
  दैर्घ्यम्‌ = .045* कनिष्ठं_चिनु(गरिष्ठ_X(), गरिष्ठ_Y())
  दलवर्णाः = [];
  गणयन्_आवर्तय (6, ( क ) => {
    दलवर्णाः[क] = यादृच्छिकसङ्ख्या(6);
  } );

  कुंचिकं_गोपाय();
  चालय(वर्ण_हिमदलानि,1)
}
