// మూలము: https://pythonturtle.academy/tutorial-drawing-egg-shape-with-python-turtle/

అండాకారము = (x, y, పరిమాణము, వాలు) => {
  కుంచికను_పైకి_ఎత్తు()
  స్థానము_మార్చు(x,y)
  కుంచికను_కింద_పెట్టు()
  దిశ_మార్చు(270+వాలు)
  రంగు_మార్చు(ఎరుపు)
  కుడివైపు_చాపాము(పరిమాణము,180)
  రంగు_మార్చు(నీలము)
  కుడివైపు_చాపాము(2*పరిమాణము,45)
  రంగు_మార్చు("ఆకుపచ్చ")
  కుడివైపు_చాపాము(0.586*పరిమాణము,90)
  రంగు_మార్చు(నీలము)
  కుడివైపు_చాపాము(2*పరిమాణము,45)
}

ప్రదర్శన = () => {
  కుంచికను_దాచు();
  అండాకారము( 90, 90, 40, 0 )
  అండాకారము( 0, 0, 90, 45 )
}