
వర్గమూలము = Math.sqrt

ప్రదర్శన = () => {
  _సర్వదా_ సవ్య = అవును;
  _సర్వదా_ అపసవ్య = !సవ్య;

  కుంచికను_దాచు();

చేప = ( వ ) => {
  వృత్తము( వ )
  కుడి_వైపు_తిరుగు( 90 );

  కుంచికను_పైకి_ఎత్తు()
  ముందుకు_జరుగు( వ );
  కుంచికను_కింద_పెట్టు()

  కుంచికను_చూపు();


  ఎడమ_వైపు_తిరుగు( 45 );
  ముందుకు_జరుగు( 2 * వ );
  కుడి_వైపు_తిరుగు(90+45)

  ముందుకు_జరుగు( వర్గమూలము( 2 * వ * 2 * వ * 2 ) );

  కుడి_వైపు_తిరుగు(90+45)
  ముందుకు_జరుగు( 2 * వ );
  ఎడమ_వైపు_తిరుగు( 45 );

  // కుంచికను_దాచు();

  కుంచికను_పైకి_ఎత్తు()
  ముందుకు_జరుగు( వ );
  కుంచికను_కింద_పెట్టు()

  కుడి_వైపు_తిరుగు( 90 );
}

రంగు_చేప = (రంగు_సంఖ్య) =>  {
  రంగు_మార్చు(రంగు_సంఖ్య)
 చేప( 40 + ( రంగు_సంఖ్య * 1 ) )
} 
లెక్క_పెడుతూ_ఆవర్తించు( 16 , (క) => రంగు_చేప( క ) )

}
