
ప్రదర్శన = () => {
    కుంచికను_దాచు();
  ఆవర్తించు(6, () => {
    రంగు_మార్చు( 0 );
    కుడి_వైపు_తిరుగు(180);
    _అత్ర_ భుజము = 100;
    _అత్ర_ రంగు_సంఖ్య = 0;
    యావత్_పరిక్రమ( () => భుజము > 0, ()=> {
  
      కుడివైపు_చాపాము(భుజము, 30 );
  
      కుడి_వైపు_తిరుగు(30);
      భుజము = భుజము - 10;
      రంగు_సంఖ్య = ( రంగు_సంఖ్య  + 15 ) % 16;
      రంగు_మార్చు( రంగు_సంఖ్య );
    } );
  });

  కుడి_వైపు_తిరుగు(310);
  కుంచికను_పైకి_ఎత్తు();
  ముందుకు_జరుగు(60 );
  కుంచికను_కింద_పెట్టు()
  రంగు_మార్చు( 13 );
  నిండు_వృత్తము(5 );
  వృత్తము(10);
}
