

కనిష్ఠ_విలువ = Math.min

_విధానము_     కోఖ్_రేఖ (పొడవు, లోతు) {
  యది_తర్హి_అన్యథా( () => (లోతు == 0),
   () => {    ముందుకు_జరుగు(పొడవు);  },
   () => {
    //  ఎడమ వైపు బుడిప 
    కోఖ్_రేఖ (పొడవు/3, లోతు-1);
    ఎడమ_వైపు_తిరుగు(60); 
    కోఖ్_రేఖ (పొడవు/3, లోతు-1);
    కుడి_వైపు_తిరుగు(120); 
    కోఖ్_రేఖ (పొడవు/3, లోతు-1);
    ఎడమ_వైపు_తిరుగు(60); 
    కోఖ్_రేఖ (పొడవు/3, లోతు-1);
  } )
}


_విధానము_     కోఖ్_హిమ_రేకు (పొడవు, లోతు) {
  కోణము (30);
  స్థానము_మార్చు(-పొడవు/2,-.3 * పొడవు);
  కోఖ్_రేఖ (పొడవు, లోతు);
  కుడి_వైపు_తిరుగు(120);
  కోఖ్_రేఖ (పొడవు, లోతు);
  కుడి_వైపు_తిరుగు(120);
  కోఖ్_రేఖ (పొడవు, లోతు);
  కుడి_వైపు_తిరుగు(120);
}
  
హిమ_రేకులు = ()=> {
  రేకు_రంగులు.push(యాదృచ్ఛిక_సంఖ్య(15) );
  రేకు_రంగులు.shift();
  లెక్క_పెడుతూ_ఆవర్తించు (6, ( క ) => {
    రంగు_మార్చు( రేకు_రంగులు [క] );
    కోఖ్_హిమ_రేకు( పొడవు * (క+1) * (క+1), క)
  } );
}

_విధానము_     ప్రదర్శన() {
  ఆది_స్థితి();
  పొడవు = .045* కనిష్ఠ_విలువ(గరిష్ఠX(), గరిష్ఠY())
  రేకు_రంగులు = [];
  లెక్క_పెడుతూ_ఆవర్తించు (6, ( క ) => {
    రేకు_రంగులు[క] = యాదృచ్ఛిక_సంఖ్య(6);
  } );

  కుంచికను_దాచు();
  ఆడించు(హిమ_రేకులు,1)
}
