// ईंट ప్రస్తారము 

_सर्वदा_    ऊंचाई = 15
_सर्वदा_    चौड़ाई = 2* ऊंचाई 

// ईंट == ఇటుక 

ईंट = ( ऊंचाई, चौड़ाई, ईंट_का_रंग) => {
  आकार_प्रारंभ_करो()
  आवर्तन_करो (2, () => {
    आगे_चलो( चौड़ाई)
    दायें_मुडो(90)
    आगे_चलो( ऊंचाई)
    दायें_मुडो(90)
  })
  आकार_समाप्त_करो( ईंट_का_रंग)
  आगे_चलो( चौड़ाई)
}

प्रदर्शन = () => {
  आदिस्थितिः()
 
  yB = गरिष्ठ_Y()
  xB = कनिष्ठ_X()
   मत_लपेटो()
  दायें_मुडो( 90)
  रंग_बदलो( 7 )

  आवर्तन_करो_जब_तक( () => కుంచిక.స్థానము.y > कनिष्ठ_Y(), () => {
    स्थान_बदलो(xB, yB)
    आवर्तन_करो_जब_तक( () => కుంచిక.స్థానము.x < गरिष्ठ_X(), () => {
      कुंंजी_नीचे_रखो()
      ईंट(ऊंचाई, चौड़ाई, "darkred")
      कुंजी_उठाओ()
    } )
    yB = yB - ऊंचाई

    स्थान_बदलो(xB - चौड़ाई/2, yB)
    आवर्तन_करो_जब_तक( () => కుంచిక.స్థానము.x < गरिष्ठ_X(), () => {
      कुंंजी_नीचे_रखो()
      ईंट(ऊंचाई, चौड़ाई, "darkred")
      कुंजी_उठाओ()
    } )
    yB = yB - ऊंचाई
  } )
}
