// గోడ घडियार

_सर्वत्र_   కొలత;

// घडियार చుట్టూ క్షణముల గీతలు గీయుటకు
_विधानम्_     క్షణముల_గీతలు(x, y, వ్యాసార్థము) {
   _अत्र_   గీత_लंबाई = 7;
   _अत्र_   ఖాళీ = వ్యాసార్థము - గీత_लंबाई;
   रंग_बदलो( 1 );
   चौड़ाई(1);
   गिनते_हुए_आवर्तन_करो( 60, ( కో ) => {
      _अत्र_ థీటా = కో * 6;
      // ప్రతి  ఐదవది దళసరి గా వేయవలెను
      चौड़ाई( ( ( కో % 5 ) ? 1 : 3)/130* కొలత)
      कुंजी_उठाओ();
      स्थान_बदलो(0,0);
      कोण_नियुक्त_करो(థీటా);
      आगे_चलो(ఖాళీ);
      कुंंजी_नीचे_रखो();
      आगे_चलो(గీత_लंबाई);
   });
   
}


// గంటలు, నిమిషాలూ సూచించే అంకెలు
_विधानम्_     అంకెలు(x, y, వ్యాసార్థము) {
   कुंजी_उठाओ();
   _अत्र_  అక్షర_माप = 20/130 * కొలత
   अक्षररूप_नियुक्त_करो(అక్షర_माप+"px sans-serif");
   रंग_बदलो("నలుపు");
   गिनते_हुए_आवर्तन_करो( 12, ( గంట ) =>{
      स्थान_बदलो(x,y);
      कोण_नियुक्त_करो(గంట * 30);
      आगे_चलो(వ్యాసార్థము); // to center of digit
      कोण_नियुक्त_करो(180);
      आगे_चलो(10/130 * కొలత); // vertical correction to baseline
      दायें_मुडो(90);
      // క్రింది, ఎడమ భాగమునకు అనుప్రస్థ సరదుబాటు
      आगे_चलो( ( (గంట < 10 ) ? 6 : 10 )/130 * కొలత)
      // if (గంట < 10) {
      //   आगे_चलो(6/130 * కొలత); // horizontal correction to lower left corner
      // } else {
      //   आगे_चलो(10/130 * కొలత)
      // }
      दायें_मुडो(180);
      लिखो(గంట);
   })
   कुंंजी_नीचे_रखो();
}

// చేతులు గీయుటకు  
_विधानम्_     చెయ్యి (థీటా, చెయ్యి_चौड़ाई, लंबाई, रंग) {
   _अत्र_   కూచి_తగ్గింపు = 5;
   _अत्र_   కూచి_తగ్గింపులు = (लंबाई / కూచి_తగ్గింపు);
   _अत्र_   चौड़ाई_సర్దుబాటు =  చెయ్యి_चौड़ाई / కూచి_తగ్గింపులు;
   स्थान_बदलो(0, 0);
   कोण_नियुक्त_करो(థీటా);
   रंग_बदलो(रंग);
   // for (_सर्वत्र_   step = 0; step < लंबाई; step = step + కూచి_తగ్గింపు) 
   गिनते_हुए_आवर्तन_करो( కూచి_తగ్గింపులు, ( అడుగు) => 
   {
      चौड़ाई( చెయ్యి_चौड़ाई ); // కుంచిక चौड़ाई
      आगे_चलो(కూచి_తగ్గింపు);
      చెయ్యి_चौड़ाई =  చెయ్యి_चौड़ाई  - चौड़ाई_సర్దుబాటు;
   }
   );
}

_विधानम्_     చేతులు(గంటలు, నిమిషములు, క్షణములు) {
    // క్షణముల చెయ్యి
    _अत्र_   క్షణముకెన్ని_డిగ్రీలు = 6;	// = 360 degrees/60 క్షణములు
    చెయ్యి(క్షణములు * క్షణముకెన్ని_డిగ్రీలు, 4, 100/130 * కొలత, "red");
    // నిమిషముల చెయ్యి 
    _अत्र_   నిమిషానికెన్ని_డిగ్రీలు = 0.1;	// = 360 degrees /3600 క్షణములు /గంట
    _अत्र_   నిమిషములుInక్షణములు = నిమిషములు * 60 + క్షణములు;
    చెయ్యి(నిమిషములుInక్షణములు * నిమిషానికెన్ని_డిగ్రీలు, 10, 100/130 * కొలత, "blue");
    // గంటల చెయ్యి
    _अत्र_   గంటకెన్ని_డిగ్రీలు = .1/12;	// = నిమిషానికెన్ని_డిగ్రీలు / 12 గంటలు 
    _अत्र_   గంటలుInక్షణములు = ((గంటలు % 12) * 3600) + నిమిషములుInక్షణములు;
    చెయ్యి(గంటలుInక్షణములు * గంటకెన్ని_డిగ్రీలు, 10, 60/130 * కొలత, "green");
}

// घडियारను పునరావృతము చేయుటకు
_विधानम्_     घडियार() {
   मिटाओ();
   కొలత = .9 *  Math.min( गरिष्ठ_X(), गरिष्ठ_Y())
   అంకెలు(0, 0, 110/130 * కొలత);
   रंग_बदलो("lightgreen");
   स्थान_बदलो(0,0);
   चौड़ाई(1/130* కొలత)
   वृत्त(130/130 * కొలత );
   క్షణముల_గీతలు(0, 0, 130/130 * కొలత );
   _अत्र_  సమయము = new Date();
   చేతులు(సమయము.getHours(), సమయము.getMinutes(), సమయము.getSeconds());
}

_विधानम्_     प्रदर्शन() {
   आदिस्थितिः();
   कुंजी_को_छुपाओ();
   चलाओ(घडियार,1000); // घडियारను ప్రతి క్షణము పునరావృతము చేయ వలెను.
}
