वर्गमूल = Math.sqrt;

प्रदर्शन = () => {
  आदिस्थितिः();
  कुंजी_को_छुपाओ();

  मछली = (వ) => {
    वृत्त(వ);
    दायें_मुडो(90);

    कुंजी_उठाओ();
    आगे_चलो(వ);
    कुंंजी_नीचे_रखो();

    कुंजी_को_दिखाओ();

    बायें_मुडो(45);
    आगे_चलो(2 * వ);
    दायें_मुडो(90 + 45);

    आगे_चलो(वर्गमूल(2 * వ * 2 * వ * 2));

    दायें_मुडो(90 + 45);
    आगे_चलो(2 * వ);
    बायें_मुडो(45);

    // कुंजी_को_छुपाओ();

    कुंजी_उठाओ();
    आगे_चलो(వ);
    कुंंजी_नीचे_रखो();

    दायें_मुडो(90);
  };

  रंग_मछली = (रंग_का_संख्यया) => {
    रंग_बदलो(रंग_का_संख्यया);
    मछली(40 + रंग_का_संख्यया * 1);
  };
  गिनते_हुए_आवर्तन_करो(16, (క) => रंग_मछली(క));
};
