

कनिष्ठ = Math.min

_विधानम्_     कोख_रेखा (लंबाई, गहराई) {
  यदि_तो_अन्यथा( () => (गहराई == 0),
   () => {    आगे_चलो(लंबाई);  },
   () => {
    //  ఎడమ వైపు బుడిప 
    कोख_रेखा (लंबाई/3, गहराई-1);
    बायें_मुडो(60); 
    कोख_रेखा (लंबाई/3, गहराई-1);
    दायें_मुडो(120); 
    कोख_रेखा (लंबाई/3, गहराई-1);
    बायें_मुडो(60); 
    कोख_रेखा (लंबाई/3, गहराई-1);
  } )
}


_विधानम्_     कोख_पुष्प (लंबाई, गहराई) {
  कोण_नियुक्त_करो (30);
  स्थान_बदलो(-लंबाई/2,-.3 * लंबाई);
  कोख_रेखा (लंबाई, गहराई);
  दायें_मुडो(120);
  कोख_रेखा (लंबाई, गहराई);
  दायें_मुडो(120);
  कोख_रेखा (लंबाई, गहराई);
  दायें_मुडो(120);
}
  
पुष्प = ()=> {
   रेखा_के_रंग.push(यादृच्छिक_संख्या(15) );
   रेखा_के_रंग.shift();
  गिनते_हुए_आवर्तन_करो (6, ( క ) => {
    रंग_बदलो(  रेखा_के_रंग [క] );
    कोख_पुष्प( लंबाई * (క+1) * (క+1), క)
  } );
}

_विधानम्_     प्रदर्शन() {
  आदिस्थितिः();
  लंबाई = .045* कनिष्ठ(गरिष्ठ_X(), गरिष्ठ_Y())
   रेखा_के_रंग = [];
  गिनते_हुए_आवर्तन_करो (6, ( క ) => {
     रेखा_के_रंग[క] = यादृच्छिक_संख्या(6);
  } );

  कुंजी_को_छुपाओ();
  चलाओ(पुष्प,1)
}
