
प्रदर्शन = () => {
  आदिस्थितिः();
    कुंजी_को_छुपाओ();
  आवर्तन_करो(6, () => {
    रंग_बदलो( 0 );
    दायें_मुडो(180);
    _अत्र_ बाजु = 100;
    _अत्र_ रंग_का_संख्यया = 0;
    आवर्तन_करो_जब_तक( () => बाजु > 0, ()=> {
  
      दायें_चाप(बाजु, 30 );
  
      दायें_मुडो(30);
      बाजु = बाजु - 10;
      रंग_का_संख्यया = ( रंग_का_संख्यया  + 15 ) % 16;
      रंग_बदलो( रंग_का_संख्यया );
    } );
  });

  दायें_मुडो(310);
  कुंजी_उठाओ();
  आगे_चलो(60 );
  कुंंजी_नीचे_रखो()
  रंग_बदलो( 13 );
  पूर्णवृत्त(5 );
  वृत्त(10);
}
